## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_custom_domain.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "mta-sts" {
      + cdn_frontdoor_profile_id = (known after apply)
      + dns_zone_id              = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/tfttest.matthewjwhite.co.uk"
      + expiration_date          = (known after apply)
      + host_name                = "mta-sts.tfttest.matthewjwhite.co.uk"
      + id                       = (known after apply)
      + name                     = "cdnmwtftestmtasts"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_custom_domain_association.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "mta-sts" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_endpoint.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "mta-sts" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "cdnmwtftestmtasts"
    }

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_origin.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_origin" "mta-sts" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + host_name                      = "stmwtftestmtasts.z33.web.core.windows.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "example-origin"
      + origin_host_header             = "stmwtftestmtasts.z33.web.core.windows.net"
      + priority                       = 1
      + weight                         = 1
    }

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_origin_group.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "mta-sts" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "cdnmwtftestmtasts"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = true

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_profile.mta-sts[0] will be created
  + resource "azurerm_cdn_frontdoor_profile" "mta-sts" {
      + id                       = (known after apply)
      + name                     = "afd-mta-sts"
      + resource_group_name      = "rg-whitefam-cdnprofiles"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
      + tags                     = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
    }

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_route.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_route" "mta-sts" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = false
      + name                          = "cdnmwtftestmtasts"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.tftest-mjw-mtasts.azurerm_dns_cname_record.mta-sts will be created
  + resource "azurerm_dns_cname_record" "mta-sts" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mta-sts"
      + record              = (known after apply)
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.tftest-mjw-mtasts.azurerm_dns_txt_record.dnsauth will be created
  + resource "azurerm_dns_txt_record" "dnsauth" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.mta-sts"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest.matthewjwhite.co.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.tftest-mjw-mtasts.azurerm_dns_txt_record.mta-sts will be created
  + resource "azurerm_dns_txt_record" "mta-sts" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_mta-sts"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest.matthewjwhite.co.uk"

      + record {
          + value = "v=STSv1; id=09e728d9759e0851b0e18eeb0efca3f0"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>